

# ==========================
# 듀얼 네트워크 필요 매크로
# ==========================

DN_FILTERS = 128  # 컨볼루션 레이어 커널 수(오리지널: 256))
DN_RESIDUAL_NUM = 16  # 레지듀얼 블록 수(오리지널: 19)
DN_INPUT_SHAPE = (3, 3, 26)  # 입력 셰이프
#(게임판:3*3)*(자신의 말 배치:6 + 상대의 말 배치:6 + 자신의 말:6 + 상대의 말:6 + 상대의패스여부:1 + 선후수:1)
DN_OUTPUT_SIZE = 55 # 행동 수(말의 이동 도착 위치(9) * 말의 종류(6) + 패스(1))

# ==========================
# 평가 파트 필요 매크로
# ==========================

EN_GAME_COUNT = 10  # 평가 1회 당 게임 수(오리지널: 400)
EN_TEMPERATURE = 1.0  # 볼츠만 분포 온도

# ==========================
# 학습 파라미터 갱신 필요 매크로
# ==========================

RN_EPOCHS = 100  # 학습 횟수

# ==========================
# 학습 사이클 필요 매크로
# ==========================

SP_SEP_COUNT = 10

# ==========================
# 셀프 플레이 필요 매크로
# ==========================

SP_GAME_COUNT = 500 // SP_SEP_COUNT  # 셀프 플레이를 수행할 게임 수(오리지널: 25,000)
SP_TEMPERATURE = 1.0  # 볼츠만 분포의 온도 파라미터
